Autodesk.Revit.DB.IExportContextProxy.OnInstanceEnd(Autodesk.Revit.DB.InstanceNode)
This method marks the end of processing of an Instance Node (e.g. a family instance).
node:
An output node that represents a family instance.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnInstanceBegin(Autodesk.Revit.DB.InstanceNode)
This method marks the start of processing of an instance node (e.g. a family instance).
Returns:
Return RenderNodeAction.Skip if you wish to skip processing this family instance,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnElementEnd(Autodesk.Revit.DB.ElementId)
This method marks the end of an element being exported.
Remarks:
This method is never called for 2D export (see cref="Autodesk::Revit::DB::IExportContext2D").
elementId:
The Id of the element that has just been processed.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnElementBegin(Autodesk.Revit.DB.ElementId)
This method marks the beginning of an element to be exported.
Remarks:
This method is never called for 2D export (see cref="Autodesk::Revit::DB::IExportContext2D").
elementId:
The Id of the element that is about to be processed.
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this element,
or return RenderNodeAction.Proceed otherwise.
Since:
2014